level-09/college_portal/app/models/student.rb

  def validate_section_mapping
    section = Section.find_by_id(section_id)
---
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def generate_roll_no
    max_count = Student.count
---
SELECT COUNT(*) FROM "students"