level-09/college_portal/app/controllers/departments_controller.rb

SELECT "departments".* FROM "departments"
---
  def index
    @departments = Department.all

INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "MECH"], ["created_at", "2019-10-11 16:42:08.828815"], ["updated_at", "2019-10-11 16:42:08.828815"]]
---
  def create
    unless current_user.admin?
      flash[:danger] = "You are not allowed to access this page."
      redirect_to root_path
    end
    @department = Department.new(department_params)

    if @department.save