level-09/college_portal/app/controllers/students_controller.rb

  def index
    if params[:section_id]
      @students = Student.where(section_id: params[:section_id]).all
    else
      @students = Student.all
---
SELECT "students".* FROM "students" WHERE "students"."section_id" = ?  [["section_id", 5]]
SELECT "students".* FROM "students"

  def new
    unless current_user.admin?
      flash[:danger] = "You are not allowed to access this page."
      redirect_to root_path
    end
    @student = Student.new
    @department_collection = Department.all.collect { |p| [p.name, p.id] }
    @section_collection = Section.all.collect { |p| [p.name, p.id] }
---
SELECT "departments".* FROM "departments"
SELECT "sections".* FROM "sections"

  def create
    unless current_user.admin?
      flash[:danger] = "You are not allowed to access this page."
      redirect_to root_path
    end
    @student = Student.new(student_params)
    @department_collection = Department.all.collect { |p| [p.name, p.id] }
    @section_collection = Section.all.collect { |p| [p.name, p.id] }

    if @student.save
---
SELECT "departments".* FROM "departments"
SELECT "sections".* FROM "sections"
INSERT INTO "students" ("name", "email", "created_at", "updated_at", "department_id", "section_id", "roll_no") VALUES (?, ?, ?, ?, ?, ?, ?)